### Pandas in 10 Minutes

In [26]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range('20130101', periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [9]:
df

                   A         B         C         D
2013-01-01  2.183540 -0.277264 -0.135352 -0.354300
2013-01-02 -1.585257  1.661191  0.556533 -1.325693
2013-01-03  0.016832  0.427895 -0.274508 -0.860713
2013-01-04 -1.440167 -0.424116  2.182483  0.955647
2013-01-05  0.016393 -0.361128 -1.861503  0.330499
2013-01-06  0.425542  0.869263  0.723700  1.272579

In [10]:
pd.Series(1, index=list(range(4)), dtype='float32')

0    1.0
1    1.0
2    1.0
3    1.0
dtype: float32

In [11]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})

In [12]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [13]:
np.array([3] * 4, dtype='int32')

array([3, 3, 3, 3], dtype=int32)

In [14]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [15]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [18]:
df.head(2)

                   A         B         C         D
2013-01-01  1.553460  0.904977  0.608247 -2.111413
2013-01-02 -0.018165  0.081798 -0.602848  0.339594

In [19]:
df.tail(2)

                   A         B         C         D
2013-01-05  0.722160  0.480225  1.964830  2.220101
2013-01-06 -1.234363 -1.684805 -1.476357  0.747773

In [20]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [21]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [22]:
df.to_numpy()

array([[ 1.55346038,  0.90497737,  0.60824675, -2.11141262],
       [-0.0181648 ,  0.08179759, -0.60284806,  0.33959363],
       [-0.27300125, -1.77104181,  1.55210947, -0.1419496 ],
       [-1.86704517, -0.33746289,  1.09577285, -0.18322501],
       [ 0.72216014,  0.48022545,  1.96483021,  2.22010132],
       [-1.23436255, -1.6848045 , -1.47635658,  0.74777312]])

In [23]:
df.shape

(6, 4)

In [24]:
type(df)

pandas.core.frame.DataFrame

In [16]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [26]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.186159 -0.387718  0.523626  0.145147
std    1.249895  1.117441  1.321986  1.413416
min   -1.867045 -1.771042 -1.476357 -2.111413
25%   -0.994022 -1.347969 -0.300074 -0.172906
50%   -0.145583 -0.127833  0.852010  0.098822
75%    0.537079  0.380618  1.438025  0.645728
max    1.553460  0.904977  1.964830  2.220101

In [27]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.553460   -0.018165   -0.273001   -1.867045    0.722160   -1.234363
B    0.904977    0.081798   -1.771042   -0.337463    0.480225   -1.684805
C    0.608247   -0.602848    1.552109    1.095773    1.964830   -1.476357
D   -2.111413    0.339594   -0.141950   -0.183225    2.220101    0.747773

In [28]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01 -2.111413  0.608247  0.904977  1.553460
2013-01-02  0.339594 -0.602848  0.081798 -0.018165
2013-01-03 -0.141950  1.552109 -1.771042 -0.273001
2013-01-04 -0.183225  1.095773 -0.337463 -1.867045
2013-01-05  2.220101  1.964830  0.480225  0.722160
2013-01-06  0.747773 -1.476357 -1.684805 -1.234363

In [29]:
df.sort_values(by="A")

                   A         B         C         D
2013-01-04 -1.867045 -0.337463  1.095773 -0.183225
2013-01-06 -1.234363 -1.684805 -1.476357  0.747773
2013-01-03 -0.273001 -1.771042  1.552109 -0.141950
2013-01-02 -0.018165  0.081798 -0.602848  0.339594
2013-01-05  0.722160  0.480225  1.964830  2.220101
2013-01-01  1.553460  0.904977  0.608247 -2.111413

In [30]:
df.sort_values(by="B",ascending=True)

                   A         B         C         D
2013-01-03 -0.273001 -1.771042  1.552109 -0.141950
2013-01-06 -1.234363 -1.684805 -1.476357  0.747773
2013-01-04 -1.867045 -0.337463  1.095773 -0.183225
2013-01-02 -0.018165  0.081798 -0.602848  0.339594
2013-01-05  0.722160  0.480225  1.964830  2.220101
2013-01-01  1.553460  0.904977  0.608247 -2.111413

In [31]:
df['A']

2013-01-01    1.553460
2013-01-02   -0.018165
2013-01-03   -0.273001
2013-01-04   -1.867045
2013-01-05    0.722160
2013-01-06   -1.234363
Freq: D, Name: A, dtype: float64

In [32]:
df[0:1]['A']

2013-01-01    1.55346
Freq: D, Name: A, dtype: float64

In [33]:
df

                   A         B         C         D
2013-01-01  1.553460  0.904977  0.608247 -2.111413
2013-01-02 -0.018165  0.081798 -0.602848  0.339594
2013-01-03 -0.273001 -1.771042  1.552109 -0.141950
2013-01-04 -1.867045 -0.337463  1.095773 -0.183225
2013-01-05  0.722160  0.480225  1.964830  2.220101
2013-01-06 -1.234363 -1.684805 -1.476357  0.747773

In [34]:
df.loc[dates[1]]

A   -0.018165
B    0.081798
C   -0.602848
D    0.339594
Name: 2013-01-02 00:00:00, dtype: float64

In [35]:
dates[1]

Timestamp('2013-01-02 00:00:00', freq='D')

In [36]:
dates = pd.date_range('20130101', periods=6)

In [37]:
df2 = pd.DataFrame({'A': 1.,
                        'B': pd.Timestamp('20130102'),
                        'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                        'D': np.array([3] * 4, dtype='int32'),
                        'E': pd.Categorical(["test", "train", "test", "train"]),
                        'F': 'foo'})

In [38]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [39]:
df.loc[dates[0]:dates[2], ['A', 'B']]

                   A         B
2013-01-01  1.553460  0.904977
2013-01-02 -0.018165  0.081798
2013-01-03 -0.273001 -1.771042

In [40]:
df=df.reset_index()
df

       index         A         B         C         D
0 2013-01-01  1.553460  0.904977  0.608247 -2.111413
1 2013-01-02 -0.018165  0.081798 -0.602848  0.339594
2 2013-01-03 -0.273001 -1.771042  1.552109 -0.141950
3 2013-01-04 -1.867045 -0.337463  1.095773 -0.183225
4 2013-01-05  0.722160  0.480225  1.964830  2.220101
5 2013-01-06 -1.234363 -1.684805 -1.476357  0.747773

In [41]:
df.loc[0:2, ['A', 'B']]

          A         B
0  1.553460  0.904977
1 -0.018165  0.081798
2 -0.273001 -1.771042

In [42]:
df.loc['20130102':'20130104', ['A', 'B']]

Empty DataFrame
Columns: [A, B]
Index: []

In [43]:
df

       index         A         B         C         D
0 2013-01-01  1.553460  0.904977  0.608247 -2.111413
1 2013-01-02 -0.018165  0.081798 -0.602848  0.339594
2 2013-01-03 -0.273001 -1.771042  1.552109 -0.141950
3 2013-01-04 -1.867045 -0.337463  1.095773 -0.183225
4 2013-01-05  0.722160  0.480225  1.964830  2.220101
5 2013-01-06 -1.234363 -1.684805 -1.476357  0.747773

In [44]:
df

       index         A         B         C         D
0 2013-01-01  1.553460  0.904977  0.608247 -2.111413
1 2013-01-02 -0.018165  0.081798 -0.602848  0.339594
2 2013-01-03 -0.273001 -1.771042  1.552109 -0.141950
3 2013-01-04 -1.867045 -0.337463  1.095773 -0.183225
4 2013-01-05  0.722160  0.480225  1.964830  2.220101
5 2013-01-06 -1.234363 -1.684805 -1.476357  0.747773

In [45]:
df.loc['20130102':'20130104', ['A', 'B']]

Empty DataFrame
Columns: [A, B]
Index: []

In [17]:
df.loc['20130102', ['A', 'B']]

A   -1.585257
B    1.661191
Name: 2013-01-02 00:00:00, dtype: float64

In [ ]:
df.loc['2013-01-01', 'A']

In [18]:
df.at[dates[0], 'A']

2.18354024095388

In [48]:
df.iloc[0, 0]

Timestamp('2013-01-01 00:00:00')

In [49]:
df

       index         A         B         C         D
0 2013-01-01  1.553460  0.904977  0.608247 -2.111413
1 2013-01-02 -0.018165  0.081798 -0.602848  0.339594
2 2013-01-03 -0.273001 -1.771042  1.552109 -0.141950
3 2013-01-04 -1.867045 -0.337463  1.095773 -0.183225
4 2013-01-05  0.722160  0.480225  1.964830  2.220101
5 2013-01-06 -1.234363 -1.684805 -1.476357  0.747773

In [50]:
df.iloc[0,0]=9999

In [19]:
df.loc['2013-01-01',['A']]

A    2.18354
Name: 2013-01-01 00:00:00, dtype: float64

In [52]:
df.iloc[2:5, 0:2]

                 index         A
2  2013-01-03 00:00:00 -0.273001
3  2013-01-04 00:00:00 -1.867045
4  2013-01-05 00:00:00  0.722160

In [53]:
df.iloc[[2, 5], [0, 2]]

                 index         B
2  2013-01-03 00:00:00 -1.771042
5  2013-01-06 00:00:00 -1.684805

In [54]:
df.iloc[1:3, :]

                 index         A         B         C         D
1  2013-01-02 00:00:00 -0.018165  0.081798 -0.602848  0.339594
2  2013-01-03 00:00:00 -0.273001 -1.771042  1.552109 -0.141950

In [55]:
df

                 index         A         B         C         D
0                 9999  1.553460  0.904977  0.608247 -2.111413
1  2013-01-02 00:00:00 -0.018165  0.081798 -0.602848  0.339594
2  2013-01-03 00:00:00 -0.273001 -1.771042  1.552109 -0.141950
3  2013-01-04 00:00:00 -1.867045 -0.337463  1.095773 -0.183225
4  2013-01-05 00:00:00  0.722160  0.480225  1.964830  2.220101
5  2013-01-06 00:00:00 -1.234363 -1.684805 -1.476357  0.747773

In [56]:
df[df['A']>0]

                 index        A         B         C         D
0                 9999  1.55346  0.904977  0.608247 -2.111413
4  2013-01-05 00:00:00  0.72216  0.480225  1.964830  2.220101

In [20]:
df[df>0]

                   A         B         C         D
2013-01-01  2.183540       NaN       NaN       NaN
2013-01-02       NaN  1.661191  0.556533       NaN
2013-01-03  0.016832  0.427895       NaN       NaN
2013-01-04       NaN       NaN  2.182483  0.955647
2013-01-05  0.016393       NaN       NaN  0.330499
2013-01-06  0.425542  0.869263  0.723700  1.272579

In [ ]:
df2=df.copy()
df2

In [ ]:
df.iloc[0,0]=1
df

In [ ]:
df2['E'] = ['india', 'india', 'aus', 'eng', 'pakistan', 'srilanka']

In [58]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [59]:
df2[0:2]

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo

In [60]:
df2[df2['E'].isin(['india','aus'])]

Empty DataFrame
Columns: [A, B, C, D, E, F]
Index: []

In [61]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))

In [62]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [63]:
df.at[dates[1], 'A'] = 0

In [64]:
df

,index,A,B,C,D
0,9999,1.553460,0.904977,0.608247,-2.111413
1,2013-01-02 00:00:00,-0.018165,0.081798,-0.602848,0.339594
2,2013-01-03 00:00:00,-0.273001,-1.771042,1.552109,-0.141950
3,2013-01-04 00:00:00,-1.867045,-0.337463,1.095773,-0.183225
4,2013-01-05 00:00:00,0.722160,0.480225,1.964830,2.220101
5,2013-01-06 00:00:00,-1.234363,-1.684805,-1.476357,0.747773
2013-01-02 00:00:00,NaN,0.000000,NaN,NaN,NaN

In [65]:
df.iat[0, 1] = 7

In [66]:
df

,index,A,B,C,D
0,9999,7.000000,0.904977,0.608247,-2.111413
1,2013-01-02 00:00:00,-0.018165,0.081798,-0.602848,0.339594
2,2013-01-03 00:00:00,-0.273001,-1.771042,1.552109,-0.141950
3,2013-01-04 00:00:00,-1.867045,-0.337463,1.095773,-0.183225
4,2013-01-05 00:00:00,0.722160,0.480225,1.964830,2.220101
5,2013-01-06 00:00:00,-1.234363,-1.684805,-1.476357,0.747773
2013-01-02 00:00:00,NaN,0.000000,NaN,NaN,NaN

In [67]:
df.loc[:, 'D'] = np.array([5])

In [68]:
df

                                   index         A         B         C  D
0                                   9999  7.000000  0.904977  0.608247  5
1                    2013-01-02 00:00:00 -0.018165  0.081798 -0.602848  5
2                    2013-01-03 00:00:00 -0.273001 -1.771042  1.552109  5
3                    2013-01-04 00:00:00 -1.867045 -0.337463  1.095773  5
4                    2013-01-05 00:00:00  0.722160  0.480225  1.964830  5
5                    2013-01-06 00:00:00 -1.234363 -1.684805 -1.476357  5
2013-01-02 00:00:00                  NaN  0.000000       NaN       NaN  5

In [69]:
df2 = df.copy()

In [23]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [73]:
df2

                                   index         A         B         C  D
0                                   9999  7.000000  0.904977  0.608247  5
1                    2013-01-02 00:00:00 -0.018165  0.081798 -0.602848  5
2                    2013-01-03 00:00:00 -0.273001 -1.771042  1.552109  5
3                    2013-01-04 00:00:00 -1.867045 -0.337463  1.095773  5
4                    2013-01-05 00:00:00  0.722160  0.480225  1.964830  5
5                    2013-01-06 00:00:00 -1.234363 -1.684805 -1.476357  5
2013-01-02 00:00:00                  NaN  0.000000       NaN       NaN  5

In [74]:
df2

                                   index         A         B         C  D
0                                   9999  7.000000  0.904977  0.608247  5
1                    2013-01-02 00:00:00 -0.018165  0.081798 -0.602848  5
2                    2013-01-03 00:00:00 -0.273001 -1.771042  1.552109  5
3                    2013-01-04 00:00:00 -1.867045 -0.337463  1.095773  5
4                    2013-01-05 00:00:00  0.722160  0.480225  1.964830  5
5                    2013-01-06 00:00:00 -1.234363 -1.684805 -1.476357  5
2013-01-02 00:00:00                  NaN  0.000000       NaN       NaN  5

In [75]:
df2=df2.reset_index()

In [76]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [77]:
df1

           index    A   B   C    D   E
2013-01-01   NaN  NaN NaN NaN  NaN NaN
2013-01-02   NaN  0.0 NaN NaN  5.0 NaN
2013-01-03   NaN  NaN NaN NaN  NaN NaN
2013-01-04   NaN  NaN NaN NaN  NaN NaN

In [78]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [79]:
df1

           index    A   B   C    D    E
2013-01-01   NaN  NaN NaN NaN  NaN  1.0
2013-01-02   NaN  0.0 NaN NaN  5.0  1.0
2013-01-03   NaN  NaN NaN NaN  NaN  NaN
2013-01-04   NaN  NaN NaN NaN  NaN  NaN

In [80]:
df1.dropna(how='any')

Empty DataFrame
Columns: [index, A, B, C, D, E]
Index: []

In [81]:
pd.isna(df1)

            index      A     B     C      D      E
2013-01-01   True   True  True  True   True  False
2013-01-02   True  False  True  True  False  False
2013-01-03   True   True  True  True   True   True
2013-01-04   True   True  True  True   True   True

In [82]:
df1=df1.fillna(0)
df1

            index    A    B    C    D    E
2013-01-01      0  0.0  0.0  0.0  0.0  1.0
2013-01-02      0  0.0  0.0  0.0  5.0  1.0
2013-01-03      0  0.0  0.0  0.0  0.0  0.0
2013-01-04      0  0.0  0.0  0.0  0.0  0.0

In [83]:
pd.isna(df1)

            index      A      B      C      D      E
2013-01-01  False  False  False  False  False  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False  False
2013-01-04  False  False  False  False  False  False

In [84]:
df.mean()

A    0.618512
B   -0.387718
C    0.523626
D    5.000000
dtype: float64

In [85]:
df

                                   index         A         B         C  D
0                                   9999  7.000000  0.904977  0.608247  5
1                    2013-01-02 00:00:00 -0.018165  0.081798 -0.602848  5
2                    2013-01-03 00:00:00 -0.273001 -1.771042  1.552109  5
3                    2013-01-04 00:00:00 -1.867045 -0.337463  1.095773  5
4                    2013-01-05 00:00:00  0.722160  0.480225  1.964830  5
5                    2013-01-06 00:00:00 -1.234363 -1.684805 -1.476357  5
2013-01-02 00:00:00                  NaN  0.000000       NaN       NaN  5

In [86]:
df.mean(axis=0)

A    0.618512
B   -0.387718
C    0.523626
D    5.000000
dtype: float64

In [87]:
df.mean()

A    0.618512
B   -0.387718
C    0.523626
D    5.000000
dtype: float64

In [88]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(3)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    NaN
2013-01-04    1.0
2013-01-05    3.0
2013-01-06    5.0
Freq: D, dtype: float64

In [89]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates)
s

2013-01-01    1.0
2013-01-02    3.0
2013-01-03    5.0
2013-01-04    NaN
2013-01-05    6.0
2013-01-06    8.0
Freq: D, dtype: float64

In [90]:
df.sub(s, axis='index')

C:\Users\Chandra.Sekar\AppData\Local\Continuum\anaconda3\lib\site-packages\pandas\core\indexes\base.py:3283: RuntimeWarning: Cannot compare type 'Timestamp' with type 'int', sort order is undefined for incomparable objects
  return this.join(other, how=how, return_indexers=return_indexers)

                    index    A   B   C    D
2013-01-01 00:00:00   NaN  NaN NaN NaN  NaN
2013-01-02 00:00:00   NaN -3.0 NaN NaN  2.0
2013-01-03 00:00:00   NaN  NaN NaN NaN  NaN
2013-01-04 00:00:00   NaN  NaN NaN NaN  NaN
2013-01-05 00:00:00   NaN  NaN NaN NaN  NaN
2013-01-06 00:00:00   NaN  NaN NaN NaN  NaN
0                     NaN  NaN NaN NaN  NaN
1                     NaN  NaN NaN NaN  NaN
2                     NaN  NaN NaN NaN  NaN
3                     NaN  NaN NaN NaN  NaN
4                     NaN  NaN NaN NaN  NaN
5                     NaN  NaN NaN NaN  NaN

In [91]:
df

                                   index         A         B         C  D
0                                   9999  7.000000  0.904977  0.608247  5
1                    2013-01-02 00:00:00 -0.018165  0.081798 -0.602848  5
2                    2013-01-03 00:00:00 -0.273001 -1.771042  1.552109  5
3                    2013-01-04 00:00:00 -1.867045 -0.337463  1.095773  5
4                    2013-01-05 00:00:00  0.722160  0.480225  1.964830  5
5                    2013-01-06 00:00:00 -1.234363 -1.684805 -1.476357  5
2013-01-02 00:00:00                  NaN  0.000000       NaN       NaN  5

In [92]:
## Apply
## Applying functions to the data:

In [135]:
df2 = pd.DataFrame({'A': 1.,
                            'B': pd.Timestamp('20130102'),
                        'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                        'D': np.array([3] * 4, dtype='int32'),
                        'E': pd.Categorical(["test", "train", "test", "train"]),
                        'F': 'foo'})

In [136]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [99]:
df2['A'].apply(np.cumsum)

0    [1.0]
1    [1.0]
2    [1.0]
3    [1.0]
Name: A, dtype: object

In [121]:
df2=df2[["A","C","D"]]
df2

     A    C  D
0  4.0  1.0  3
1  1.0  1.0  3
2  1.0  1.0  3
3  1.0  1.0  3

In [102]:
df2.apply(np.mean)

A    1.0
C    1.0
D    3.0
dtype: float64

In [104]:
df2.iloc[0,0]=4

C:\Users\Chandra.Sekar\AppData\Local\Continuum\anaconda3\lib\site-packages\pandas\core\indexing.py:543: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s

In [119]:
df2

     A    C  D
0  4.0  1.0  3
1  1.0  1.0  3
2  1.0  1.0  3
3  1.0  1.0  3

In [108]:
def evennum(x):
    if x%2==0:
        return x

In [115]:
evennum(16)

16

In [117]:
### doubttu 
df2["A"].apply(evennum)

0    4.0
1    NaN
2    NaN
3    NaN
Name: A, dtype: float64

In [123]:

df2.apply(lambda x: x.max() - x.min())

A    3.0
C    0.0
D    0.0
dtype: float64

In [126]:
df2.min()

A    1.0
C    1.0
D    3.0
dtype: float64

In [127]:
df2

     A    C  D
0  4.0  1.0  3
1  1.0  1.0  3
2  1.0  1.0  3
3  1.0  1.0  3

In [133]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    3
1    5
2    2
3    0
4    6
5    1
6    0
7    5
8    4
9    2
dtype: int32

In [134]:
s.value_counts()

5    2
2    2
0    2
6    1
4    1
3    1
1    1
dtype: int64

In [138]:
df2['E'].value_counts()

train    2
test     2
Name: E, dtype: int64

In [139]:
## String Methods

In [140]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [141]:
type(s)

pandas.core.series.Series

In [143]:
s.str.upper()

0       A
1       B
2       C
3    AABA
4    BACA
5     NaN
6    CABA
7     DOG
8     CAT
dtype: object

In [144]:
## Merge

In [145]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  1.174350  1.098188 -1.472494 -0.610809
1  0.941992  0.586638  0.548326 -2.218808
2 -0.081815  0.049645 -0.290190 -0.352377
3  0.060769 -1.681597 -0.135597  1.299378
4  0.407458  0.903685 -0.431826 -0.820815
5 -0.558842 -1.413766 -0.343297 -0.082917
6  0.763641  0.629755  1.094760  0.578151
7  0.964840 -0.408041  1.330589 -0.220090
8 -0.101533 -1.227163  0.525783 -1.230362
9  1.414692  0.078032  0.191740  1.187225

In [146]:
pieces=[df[:3], df[3:7], df[7:]]
pd.concat(pieces)

          0         1         2         3
0  1.174350  1.098188 -1.472494 -0.610809
1  0.941992  0.586638  0.548326 -2.218808
2 -0.081815  0.049645 -0.290190 -0.352377
3  0.060769 -1.681597 -0.135597  1.299378
4  0.407458  0.903685 -0.431826 -0.820815
5 -0.558842 -1.413766 -0.343297 -0.082917
6  0.763641  0.629755  1.094760  0.578151
7  0.964840 -0.408041  1.330589 -0.220090
8 -0.101533 -1.227163  0.525783 -1.230362
9  1.414692  0.078032  0.191740  1.187225

In [148]:
## Join

In [151]:
dict1={'key': ['foo', 'foo'], 'lval': [1, 2]}
left = pd.DataFrame(dict1)
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [152]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [153]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [154]:
## Grouping

In [155]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                           'foo', 'bar', 'foo', 'foo'],
                     'B': ['one', 'one', 'two', 'three',
                             'two', 'two', 'one', 'three'],
                      'C': np.random.randn(8),
                       'D': np.random.randn(8)})

In [157]:
df

     A      B         C         D
0  foo    one  0.759922 -0.695075
1  bar    one  0.081218 -0.815415
2  foo    two  0.445347  1.579895
3  bar  three  0.793628 -1.275858
4  foo    two  1.396691  0.696298
5  bar    two -0.735628 -0.177743
6  foo    one  0.451863 -0.568123
7  foo  three -1.373981 -0.437186

In [156]:
df.groupby('A').sum()

            C         D
A
bar  0.139217 -2.269015
foo  1.679842  0.575808

In [158]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    0.081218 -0.815415
    three  0.793628 -1.275858
    two   -0.735628 -0.177743
foo one    1.211785 -1.263198
    three -1.373981 -0.437186
    two    1.842038  2.276193

In [167]:
## Reshaping - stack

In [160]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                         'foo', 'foo', 'qux', 'qux'],
                        ['one', 'two', 'one', 'two',
                         'one', 'two', 'one', 'two']]))

In [161]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [162]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [163]:
df2 = df[:4]

In [164]:
df2

                     A         B
first second
bar   one    -0.876866  1.416613
      two    -0.926513  0.341061
baz   one     0.461084  1.919077
      two     2.258938  0.963708

In [165]:
stacked = df2.stack()

In [166]:
stacked

first  second
bar    one     A   -0.876866
               B    1.416613
       two     A   -0.926513
               B    0.341061
baz    one     A    0.461084
               B    1.919077
       two     A    2.258938
               B    0.963708
dtype: float64

In [168]:
 stacked.unstack()

                     A         B
first second
bar   one    -0.876866  1.416613
      two    -0.926513  0.341061
baz   one     0.461084  1.919077
      two     2.258938  0.963708

In [169]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                      'B': ['A', 'B', 'C'] * 4,
                       'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                       'D': np.random.randn(12),
                      'E': np.random.randn(12)})

In [170]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -1.108209  0.751475
      B -0.786442 -1.128109
      C  0.699888 -0.392730
three A -0.846693       NaN
      B       NaN  0.764258
      C -0.564120       NaN
two   A       NaN  1.404365
      B  2.961855       NaN
      C       NaN -0.461194

In [171]:
## Time series

In [172]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

In [175]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts

2012-01-01 00:00:00    125
2012-01-01 00:00:01     58
2012-01-01 00:00:02    404
2012-01-01 00:00:03    294
2012-01-01 00:00:04    406
2012-01-01 00:00:05    293
2012-01-01 00:00:06    136
2012-01-01 00:00:07    438
2012-01-01 00:00:08    310
2012-01-01 00:00:09    476
2012-01-01 00:00:10    320
2012-01-01 00:00:11    475
2012-01-01 00:00:12    388
2012-01-01 00:00:13    325
2012-01-01 00:00:14    229
2012-01-01 00:00:15    289
2012-01-01 00:00:16    144
2012-01-01 00:00:17    411
2012-01-01 00:00:18    471
2012-01-01 00:00:19    465
2012-01-01 00:00:20     10
2012-01-01 00:00:21    386
2012-01-01 00:00:22    469
2012-01-01 00:00:23     52
2012-01-01 00:00:24     40
2012-01-01 00:00:25    259
2012-01-01 00:00:26     73
2012-01-01 00:00:27    347
2012-01-01 00:00:28    404
2012-01-01 00:00:29     89
                      ...
2012-01-01 00:01:10     49
2012-01-01 00:01:11    477
2012-01-01 00:01:12    285
2012-01-01 00:01:13    450
2012-01-01 00:01:14    348
2012-01-01 00:01:15    218
2012-01-01 00:01:16     69
2012-01-01 00:01:17    261
2012-01-01 00:01:18    340
2012-01-01 00:01:19    117
2012-01-01 00:01:20     78
2012-01-01 00:01:21    171
2012-01-01 00:01:22    187
2012-01-01 00:01:23    262
2012-01-01 00:01:24    355
2012-01-01 00:01:25     69
2012-01-01 00:01:26    187
2012-01-01 00:01:27    177
2012-01-01 00:01:28    238
2012-01-01 00:01:29     50
2012-01-01 00:01:30    327
2012-01-01 00:01:31    126
2012-01-01 00:01:32     25
2012-01-01 00:01:33    309
2012-01-01 00:01:34    217
2012-01-01 00:01:35    370
2012-01-01 00:01:36    345
2012-01-01 00:01:37    224
2012-01-01 00:01:38    419
2012-01-01 00:01:39    232
Freq: S, Length: 100, dtype: int32

In [174]:
ts.resample('5Min').sum()

2012-01-01    23796
Freq: 5T, dtype: int32

In [176]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')

In [177]:
df = pd.DataFrame({"id": [1, 2, 3, 4, 5, 6],
                       "raw_grade": ['a', 'b', 'b', 'a', 'a', 'e']})

In [178]:
df["grade"] = df["raw_grade"].astype("category")

In [179]:
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [180]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

In [183]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium",
                                                  "good", "very good"])

In [184]:
df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [186]:
df.sort_values(by="raw_grade")

   id raw_grade      grade
0   1         a  very good
3   4         a  very good
4   5         a  very good
1   2         b       good
2   3         b       good
5   6         e   very bad

In [189]:
df.groupby("grade").size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64